Autodesk.Revit.DB.IFC.IExporterIFCProxy.ExportIFC(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.View)
The method that Revit will invoke to perform an export to IFC.
Remarks:
There will be a transaction group opened for the document.  Any changes made to the document
must be temporary, as the transaction group will automatically be rolled back at the end.
document:
The document to export.
exporter:
The IFC exporter object.
filterView:
The view whose filter visibility settings govern the export.
Since:
2012